Функция ВерсияEDT() Экспорт
	Возврат Константы.ВерсияEDT.Получить();
КонецФункции

Функция ОсновнаяПрограммаСравнения2(Параметры) Экспорт
	Возврат СтрШаблон(Константы.ОсновнаяКомандаДвухстороннегоСравнения.Получить()
		,Параметры[0], Параметры[1]
		,ПараметрВСтроку(Параметры, 2), ПараметрВСтроку(Параметры, 3));
КонецФункции
	
Функция ОсновнаяПрограммаСравнения3(Параметры) Экспорт
	Возврат СтрШаблон(Константы.ОсновнаяКомандаТрехстороннегоСравнения.Получить()
		,Параметры[0], Параметры[1], Параметры[2]
		,ПараметрВСтроку(Параметры, 3), ПараметрВСтроку(Параметры, 4), ПараметрВСтроку(Параметры, 5));
КонецФункции
	
Функция ПараметрВСтроку(Параметры, ИндПараметра)
	Если ИндПараметра <= Параметры.Количество() Тогда
		Возврат """" + СтрЗаменить(Параметры[ИндПараметра], """", """""") + """";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции