#Если ТолстыйКлиентУправляемоеПриложение Тогда	
Процедура ПередНачаломРаботыСистемы(Отказ)
	Если СтрНачинаетсяС(ПараметрЗапуска, "ЗапускВнешнейОбработки") Тогда
		// обычный запуск
	Иначе
		МассивПараметры = СтрРазделить(ПараметрЗапуска, ";", Истина);
		Если МассивПараметры.Количество() = 0 Тогда
			Предупреждение(НСтр("ru = 'Неверное количество параметров'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ЧтениеТекста = Новый ЧтениеТекста(МассивПараметры[1]);
		ПерваяСтрока = ЧтениеТекста.ПрочитатьСтроку();
		ВтораяСтрока = ЧтениеТекста.ПрочитатьСтроку();
		Если ПерваяСтрока = "<?xml version=""1.0"" encoding=""UTF-8""?>"
			И СтрНачинаетсяС(ВтораяСтрока, "<document xmlns=""http://v8.1c.ru/8.2/data/spreadsheet""") Тогда
			
			ОткрытьФорму("Обработка.СравнениеТабличныхДокументов.Форма.Инициализация");
			
		Иначе
			Отказ = Истина;
			Если МассивПараметры.Количество() = 2
				ИЛИ МассивПараметры.Количество() = 4 Тогда
			
				КомандаСравнения = НастройкиКлиентСерверПереопределяемый.ОсновнаяПрограммаСравнения2(МассивПараметры);
			
			ИначеЕсли МассивПараметры.Количество() = 3
				ИЛИ МассивПараметры.Количество() = 6 Тогда
				
				КомандаСравнения = НастройкиКлиентСерверПереопределяемый.ОсновнаяПрограммаСравнения3(МассивПараметры);
			Иначе
				Предупреждение(НСтр("ru = 'Неверное количество параметров'"));
				Возврат;
			КонецЕсли;
			
			ЗапуститьПриложение(КомандаСравнения, , Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
