Функция ВерсияEDT() Экспорт
	Возврат "2021.1.7";
КонецФункции

Функция ОсновнаяПрограммаСравнения2(Параметры) Экспорт
	Возврат СтрШаблон("""C:\Users\Chtcherbakov\AppData\Local\Apps\Araxis\Araxis Merge\Compare.exe"""
		+ " /wait /2 /readonly /a1 /title1:%3 /title2:%4  %1 %2"
		,Параметры[0], Параметры[1]
		,ПараметрВСтроку(Параметры, 2), ПараметрВСтроку(Параметры, 3));
КонецФункции
	
Функция ОсновнаяПрограммаСравнения3(Параметры) Экспорт
	Возврат СтрШаблон("""C:\Users\Chtcherbakov\AppData\Local\Apps\Araxis\Araxis Merge\Compare.exe"""
		+ " /wait /3 /readonly /a1 /title1:%4 /title2:%5 /title3:%6 %1 %2 %3"
		,Параметры[0], Параметры[1], Параметры[2]
		,ПараметрВСтроку(Параметры, 3), ПараметрВСтроку(Параметры, 4), ПараметрВСтроку(Параметры, 5));
КонецФункции
	
Функция ПараметрВСтроку(Параметры, ИндПараметра)
	Если ИндПараметра <= Параметры.Количество() Тогда
		Возврат """" + СтрЗаменить(Параметры[ИндПараметра], """", """""") + """";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции