Функция ДобавитьЧастиПути(Знач Текст
	,Часть1 = Неопределено,Часть2 = Неопределено, Часть3 = Неопределено, Часть4 = Неопределено, Часть5 = Неопределено, Часть6 = Неопределено) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindows() Тогда
		Разделитель = "\";
	Иначе
		Разделитель = "/";
	КонецЕсли;
	
	ЧастиПути = Новый Массив;
	Если Часть1 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть1);
	КонецЕсли;
	Если Часть2 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть2);
	КонецЕсли;
	Если Часть3 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть3);
	КонецЕсли;
	Если Часть4 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть4);
	КонецЕсли;
	Если Часть5 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть5);
	КонецЕсли;
	Если Часть6 <> Неопределено Тогда
		ЧастиПути.Добавить(Часть6);
	КонецЕсли;
	
	Пока Прав(Текст, 1) = Разделитель Цикл
		Текст = Лев(Текст, СтрДлина(Текст) - 1);
	КонецЦикла;
	
	ЧастиПути.Вставить(0, Текст);
	Возврат СтрСоединить(ЧастиПути, Разделитель);
КонецФункции
